<template>
  <div class="container">
    <RouterView />
  </div>
</template>

<script setup>
import {RouterView} from "vue-router"

</script>

<style scoped>
.container {
  max-width: 1000px;
  margin: 0 auto;
}
</style>
<!--Создание и добавление библиотеки router начинается с добавления ее в проект командой-->
<!--npm install vue-router . Далее мы создаем папку router и создаем js файл в котором-->
<!--описывает логику созадния библиотеки и ее путей : import {createRouter, createWebHistory} from 'vue-router',-->
<!--далее мы описываем в функции createRouter логитку и массив путей , после експортитуем его из файла-->

<!--Далее , чтобы после подключения и создания библиотеки мы могли использовать ее в нашем приложении-->
<!--мы должны подключить router в main.js файл , импортирова router по пути в котром он лежит и-->
<!--добавить с помощью функции use() нашу библиотеку , также добавляются все сторонние библиотеки-->
<!--такие как BootsTrap WeBPack и тд-->

<!--RouterView - для вывода роутинговых страниц приложения ,обычно распологаются в корневом-->
<!--файле app содержа в себе приложение-->
<!--RouterLink - ссылки для перехода по страницам , использующие атрибут to="" который указывает-->
<!--путь из [] массива роутер библиотеки в index.js файле-->

<!--$router.push('/')Router - для использования постраничной навигации-->
<!--$route.param.id Route - для использования данных содержащихся в объекте пути и тд ,-->
<!--например получения динамического id-->

<!--Vuex &#45;&#45;&ndash;&gt;-->
<!-- -&#45;&#45;-->
